.config/test-estate-evidence/supervisor-shape-fold/missing-host/planted-fault.diff
--- a/crates/vigil/src/supervisor.rs
+++ b/crates/vigil/src/supervisor.rs
@@ -199,7 +199,11 @@
         return None;
     }
     let data = resp.data?;
-    let host = data.host.filter(|h| !h.is_empty())?;
+    let host = match data.host {
+        None => "fallback-host".to_string(),
+        Some(h) if h.is_empty() => return None,
+        Some(h) => h,
+    };
     Some(MqttConfig {
         broker_host: host,
         broker_port: data.port.unwrap_or(1883),
