.config/test-estate-evidence/transport-purity-widen/no-iroh-symbol-in-vigil-src/planted-fault.diff
diff --git a/crates/vigil/src/control_socket.rs b/crates/vigil/src/control_socket.rs
index 6b3de70..241d11f 100644
--- a/crates/vigil/src/control_socket.rs
+++ b/crates/vigil/src/control_socket.rs
@@ -8,3 +8,6 @@ pub(crate) fn control_socket_path(data_dir: &Path) -> PathBuf {
         .map(Into::into)
         .unwrap_or_else(|| data_dir.join("control.sock"))
 }
+
+#[allow(dead_code)]
+const TEST_ESTATE_PLANTED_FAULT_TRANSPORT_NAME: &str = "iroh";
