.config/test-estate-evidence/vigil-bin-dependency-guard-widen/substrate-catch/planted-fault.diff
diff --git a/crates/vigil/tests/dependency_direction_contract.rs b/crates/vigil/tests/dependency_direction_contract.rs
index 71e4278..68bff7c 100644
--- a/crates/vigil/tests/dependency_direction_contract.rs
+++ b/crates/vigil/tests/dependency_direction_contract.rs
@@ -306,9 +306,8 @@ fn direct_forbidden_names(graph: &Graph, package: &str, forbidden: &[&str]) -> V
 /// `cargo metadata`'s own dependency shape (see the module doc), so neither
 /// changes what this predicate sees.
 fn edge_is_normal_or_build(edge: &Edge) -> bool {
-    edge.kinds
-        .iter()
-        .any(|kind| matches!(kind.as_deref(), None | Some("build")))
+    let _ = edge;
+    false
 }
 
 /// Check only `package`'s own DIRECT NORMAL (shipped-in-the-binary) and
